Revit 2024 API
Ceiling.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId)
 Creates a new instance of ceiling within the project.
Create(Document, IList<CurveLoop>, ElementId, ElementId, Line, Double)
 Creates a new instance of ceiling within the project.
See Also
Ceiling Class
Ceiling Members
Autodesk.Revit.DB Namespace